/**
 * @fileOverview 数据字典静态类
 * 
 * @author chenqianqian(25292)
 * @version 1.0.2
 */
define(function(){
	var sw_dic = {
		"systemDicMap": {
			"source": {
				1:'高端人才',
				2:'寻英推荐',
				10:'内部人才'
			},
			"org_type": {
				1:'市委组织部/管理员',
				2:'市级部门/区组织部',
				3:'区级部门/园区/街道办',
				4:'企业'
			},
			"roleType":{
				1:'市委组织部/管理员',
				2:'市级部门',
				3:'区组织部',
				4:'区级部门',
				5:'园区/街道办',
				6:'企业'
			},
			"expert_type":{
				"高级人才":'高级人才',
				"中级人才":'中级人才',
				"低级人才":'低级人才'
			},
			"industry":{
				0:'电子信息',
				1:'生物医药',
				2:'制造',
				3:'节能环保',
				4:'现代农业',
				5:'材料与新材料',
				6:'能源与新能源'
			},"inland_level":{
				/*国内*/
				0:'中国科学院院士',
				1:'中国工程院院士',
				2:'“国千”人才',
				3:'“国万”人才',
				4:'长江学者',
				5:'国家百千万人才',
				6:'国家杰出青年',
				7:'百人计划',
				8:'院校（TOP100）教授（国内人才）',
				9:'研究员',
				/*国外*/
				10:'诺贝尔奖',
				11:'图灵奖',
				12:'菲尔兹奖',
				13:'院校（TOP100）教授(国外人才)'
			},"foreign_leve":{
				0:'诺贝尔奖',
				1:'图灵奖',
				2:'菲尔兹奖',
				3:'院校（TOP100）教授'
			},"date_updated":{
				0:'2天内',
				1:'7天内',
				2:'15天内',
				3:'1个月内',
				4:'不限'
			},
			"role":{
				1:"数据分析",
			/*	3:"人才查询",
				4:"人才详情",*/
				5:"发布职位",
	/*			6:"审核推荐",*/
				7:"协作记录",
				10:"角色管理",
				8:"账号信息",
				9:"团队成员"
			},
			"gender": {"不限": "不限", "女": "女", "男": "男"},
			"educationType": {"专科": "专科","本科": "本科","硕士研究生": "硕士研究生",  "博士研究生": "博士研究生", "高中（中专及以下）": "高中（中专及以下）"},
			"collegeType": {"不限":"不限","985院校": "985院校", "211院校": "211院校", "其他院校": "其他院校"},
			"experienceType": {
				"不限": "不限",
				"应届毕业生": "应届毕业生",
				"1年以下": "1年以下",
				"1-3年": "1-3年",
				"3-5年": "3-5年",
				"5-10年": "5-10年",
				"10年以上": "10年以上"
			},
            "exp": {"0": "教育经历", "1": "工作经历"},
			"jobTitle": {"职称1": "职称1", "职称2": "职称2"},
			"nvq": {"职业资格1": "职业资格1", "职业资格2": "职业资格2"},
			"nvq1": {"十支人才类别1": "十支人才类别1", "十支人才类别2": "十支人才类别2"},
			"state": {"在职": "在职", "离职": "离职"},
            "age": {"不限": "不限", "18-20": "18-20", "20-25": "20-25"}
		}, "systemDicArray": {}, "staticDicMap": {}
	};

	return sw_dic;
})



